{"config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "filters": 32, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_6", "dtype": "float32", "padding": "valid", "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [6, 6], "strides": [1, 1], "batch_input_shape": [null, 28, 28, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_6"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.4, "name": "dropout_6", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_6", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "name": "dense_11", "units": 128, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "softmax", "bias_constraint": null, "kernel_constraint": null, "name": "dense_12", "units": 10, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.3", "backend": "tensorflow"}