{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "name": "conv2d_9", "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "padding": "valid", "batch_input_shape": [null, 28, 28, 1], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [6, 6], "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "strides": [1, 1], "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "rate": 0.4}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "padding": "valid", "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [6, 6], "use_bias": true, "activation": "relu", "name": "conv2d_10", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "strides": [1, 1], "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_10", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_10", "trainable": true, "rate": 0.4}}, {"class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "units": 128, "name": "dense_13", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "units": 64, "name": "dense_14", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "units": 10, "name": "dense_15", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true}}], "keras_version": "2.0.3"}